Holleide/espai-cloud-build-test/sdkconfig.defaults
# ESP32-S3 BLE信标基站 - NimBLE版默认配置
# 芯片配置
CONFIG_IDF_TARGET="esp32s3"

# CPU 配置 - 高性能模式
CONFIG_ESP_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# NimBLE配置
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=0
CONFIG_BT_NIMBLE_MAX_BONDS=0
CONFIG_BT_NIMBLE_ACL_BUF_COUNT=4
CONFIG_BT_NIMBLE_ACL_BUF_SIZE=255
CONFIG_BT_NIMBLE_HCI_EVT_BUF_SIZE=70
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=6
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
CONFIG_BT_NIMBLE_PINNED_TO_CORE=0
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_INTERNAL=y

# iBeacon 默认配置 (可通过menuconfig修改)
CONFIG_IBEACON_MAJOR=1
CONFIG_IBEACON_MINOR=1
CONFIG_IBEACON_TX_POWER=-59
CONFIG_IBEACON_ADV_INTERVAL_MS=20
CONFIG_IBEACON_POSITION_X=0
CONFIG_IBEACON_POSITION_Y=0

# FreeRTOS 配置
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_MAX_TASK_NAME_LEN=16

# 电源管理 - 高性能模式禁用省电
CONFIG_PM_ENABLE=n
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n

# 日志配置
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_COLORS=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

# NVS 配置
CONFIG_NVS_ENCRYPTION=n
CONFIG_NVS_ASSERT_ERROR_CHECK=y

# 看门狗配置
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_ESP_INT_WDT=n

# 优化配置
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y

# 调试配置
CONFIG_ESP_DEBUG_OC_ENABLE=n
CONFIG_ESP_DEBUG_STUBS_ENABLE=n

# 串口配置
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# 分区配置
CONFIG_PARTITION_TABLE_SINGLE_APP=y
CONFIG_PARTITION_TABLE_SINGLE_APP_FILENAME="partitions_singleapp.csv"

# PSRAM配置
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# 禁用Unity测试框架（避免Git子模块问题）
CONFIG_UNITY_ENABLE=n
